Python 3.6.2 (v3.6.2:5fd33b5, Jul  8 2017, 04:57:36) [MSC v.1900 64 bit (AMD64)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> 
================== RESTART: C:/Users/Илья/Desktop/прога.py ==================
Traceback (most recent call last):
  File "C:/Users/Илья/Desktop/прога.py", line 10, in <module>
    for i in range(0, n):
NameError: name 'n' is not defined
>>> 
================== RESTART: C:/Users/Илья/Desktop/прога.py ==================

Что такое инфляция?
1) Повышение цен
2) Понижение цен

Ваш ответ: 1
Правильно
Вы правильно ответили на  1  вопросов из  1
>>> 
================== RESTART: C:/Users/Илья/Desktop/прога.py ==================

Что такое инфляция?
1) Повышение цен
2) Понижение цен

Ваш ответ: 2
Неправильно (
Вы правильно ответили на  0  вопросов из  1
>>> 
================== RESTART: C:/Users/Илья/Desktop/прога.py ==================

Что такое инфляция?
1) Повышение цен
2) Понижение цен

Ваш ответ: 2
Неправильно
Вы правильно ответили на  0  вопросов из  1
>>> 
================== RESTART: C:/Users/Илья/Desktop/прога.py ==================

Что такое инфляция?
1) Повышение цен
2) Понижение цен
Зачем учавствовать в олимпиадах?
1)Чтоб ложануться
2) просто так
3) от нечего делать
4) мама говорит что этопригодиться

Ваш ответ: 
================== RESTART: C:/Users/Илья/Desktop/прога.py ==================

Что такое инфляция?
1) Повышение цен
2) Понижение цен

Ваш ответ: 1
Правильно
>>> 
>>> 
================= RESTART: C:/Users/Илья/Desktop/тест 2.0.py =================
Traceback (most recent call last):
  File "C:/Users/Илья/Desktop/тест 2.0.py", line 11, in <module>
    picle.dump(answers, datafile)
NameError: name 'picle' is not defined
>>> 
================= RESTART: C:/Users/Илья/Desktop/тест 2.0.py =================
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3

Ваш ответ: 3
Правильно
>>> 
>>> 
>>> 
>>> 
>>> 
================== RESTART: C:/Users/Илья/Desktop/прога.py ==================

Что такое инфляция?
1) Повышение цен
2) Понижение цен

Ваш ответ: 3
Неправильно
Вы правильно ответили на  0  вопросов из  1
>>> 
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3

Ваш ответ: 3
Правильно
>>> 
================= RESTART: C:/Users/Илья/Desktop/тест 2.0.py =================
>>> 
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 3
Неправильно
Вы правильно ответили на  0  вопросов из  2
>>> 
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 3 5
Traceback (most recent call last):
  File "C:/Users/Илья/Desktop/ntcn.py", line 15, in <module>
    a = int(input("Ваш ответ: "))
ValueError: invalid literal for int() with base 10: '3 5'
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================
Ваш ответ: 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 4
Правильно
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 4
Ваш ответ: 4
Правильно
>>> 
================= RESTART: C:\Users\Илья\Desktop\тест 2.0.py =================
Ваш ответ: 2
Traceback (most recent call last):
  File "C:\Users\Илья\Desktop\тест 2.0.py", line 9, in <module>
    if a == answers[i]:
NameError: name 'answers' is not defined
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 
================= RESTART: C:\Users\Илья\Desktop\тест 2.0.py =================
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 4
Правильно1
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================
Ваш ответ: 
================= RESTART: C:\Users\Илья\Desktop\тест 2.0.py =================
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

какие экономические цели имеет государство?
1)Структурную и стабилизационную
2)Структурную и защитную
3)Производственную и стабилизационную


Какую из функций не имеет государство?
1)защита прав собственности
2)Регулиирование рынка труда
3)Средство платежа
Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5


Что из перечисленного не является видом налога?
1)Прямой налог
2)Косвенный налог
3)федеральный налог

Ваш ответ: 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

какие экономические цели имеет государство?
1)Структурную и стабилизационную
2)Структурную и защитную
3)Производственную и стабилизационную


Какую из функций не имеет государство?
1)защита прав собственности
2)Регулиирование рынка труда
3)Средство платежа
Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5


Что из перечисленного не является видом налога?
1)Прямой налог
2)Косвенный налог
3)федеральный налог

Ваш ответ: 
	3
Traceback (most recent call last):
  File "C:/Users/Илья/Desktop/ntcn.py", line 15, in <module>
    a = int(input("Ваш ответ: "))
ValueError: invalid literal for int() with base 10: ''
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

какие экономические цели имеет государство?
1)Структурную и стабилизационную
2)Структурную и защитную
3)Производственную и стабилизационную


Какую из функций не имеет государство?
1)защита прав собственности
2)Регулиирование рынка труда
3)Средство платежа
Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5


Что из перечисленного не является видом налога?
1)Прямой налог
2)Косвенный налог
3)федеральный налог

Ваш ответ: 3
Правильно1
>>> 
=================== RESTART: C:/Users/Илья/Desktop/ntcn.py ===================

какие экономические цели имеет государство?
1)Структурную и стабилизационную
2)Структурную и защитную
3)Производственную и стабилизационную


Какую из функций не имеет государство?
1)защита прав собственности
2)Регулиирование рынка труда
3)Средство платежа


Сколько типов имеют налоги?
1)1
2)2
3)3


Сколько функций имеют налоги?
1)8
2)4
3)6
4)5

Ваш ответ: 
